{
    "outside": {
        "name": "Outside the House",
        "description": [
            "You are outside. You see a spooky mansion off in the distance.",
            "The moon is just starting to rise."
        ],
        "hint": [
            "Not much to do out here other than to enter the house.\nUse the cd command to move."
        ],
        "files": [
            {
                "name": "paper",
                "contents": [
                    "You see a piece of paper lying on the ground.",
                    "You pick up the paper and read the following message:",
                    "  Welcome to my spooky mansion game!",
                    "  I hope you have a fun time.",
                    "  Never stop coding, and have a Happy Halloween!",
                    "  - Dr. Bart",
                    "You put the paper back on the ground for the next person."
                ]
            }
        ],
        "secretLinks": {},
        "links": ["house"]
    },
    "foyer": "house",
    "house": {
        "name": "Inside the House",
        "description": [
            "You are inside the Foyer of the house. You see a single door ahead of you. Cobwebs litter the house."
        ],
        "hint": ["Not much to do here, other than to cd into the next room."],
        "files": [],
        "secretLinks": {},
        "links": ["outside", "library"]
    },
    "library": {
        "name": "Library",
        "description": [
            "You enter into a surprisingly warm and cozy library.",
            "Curled up on a nearby chair is a fat cat.",
            "On the floor nearby is a book.",
            "You don't really anywhere else to go, though."
        ],
        "hint": ["The cat might know how to read the book.\n cat book"],
        "files": [
            {
                "name": "book",
                "contents": [
                    "You attempt to read the book, but alas it is unreadable.",
                    "In fact, it just appears to say 'MEOW' over and over again.",
                    "    MEOW MEOW MEOW MEOW MEOW",
                    "    MEOW MEOW MEOW MEOW.",
                    "    MEOW MEOW MEOW, MEOW MEOW",
                    "    MEOW MEOW MEOW",
                    "    ...",
                    "If only someone could help you translate the mysterious language."
                ]
            }
        ],
        "secretLinks": {
            "catted": "hallway"
        },
        "links": ["foyer"]
    },
    "hallway": {
        "name": "Hallway",
        "description": [
            "You enter a stately hallway lit by candles. Before you stands a man with a deathly pallor and long, pointed teeth. He grins maliciously and says with a thick accent:",
            "*\"I wouldn't mind a bit of a bite, or at least **half a bite**. In other words, do you know what I am looking for?\"*",
            "He clearly wants you to say something. Perhaps there is a word you can type that will satisfy him?"
        ],
        "hint": [
            "When you talk to the vampire, he asks you what half a bite (byte) is.",
            "If you don't know, ask Google.",
            "Then, enter that as the prompt."
        ],
        "files": [],
        "links": ["library"],
        "secretLinks": {
            "nibble": "kitchen"
        }
    },
    "kitchen": {
        "name": "Kitchen",
        "description": [
            "In the kitchen, there appears to be a bunch of zombie (processes)!",
            "Although they aren't moving around very much, they are blocking your path.",
            "You need to thin the herd somehow."
        ],
        "hint": [
            "Zombie processes are stray programs that are not easily stopped.",
            "The linux command to dispose of them is quite gruesome, though.",
            "Simply use the following command and they'll go away:",
            "    kill"
        ],
        "files": [],
        "links": ["hallway"],
        "secretLinks": {
            "zombies": "courtyard"
        }
    },
    "courtyard": {
        "name": "Courtyard",
        "description": [
            "In the middle of the courtyard, you see a gigantic snake! It has a cup of hot, dark liquid. Its teeth are sharp and pearly, while its mouth is a rusty, ruby red. When it sees you, it speaks as if reciting an old script.",
            "  *Hello human. If you wissssh to passss, you must ansssswer the following quessstion: What issss the bessst programming language?*",
            "What could its scheme be? Well, it is clear you cannot go on until you answer correctly."
        ],
        "hint": [
            "The description gives a lot of conflicting hints.",
            "But maybe its not any of them?",
            "I mean, how can you even decide what the \"best\" language is?",
            "Perhaps there is no right answer..."
        ],
        "files": [],
        "links": ["kitchen"],
        "secretLinks": {
            "language": "garden"
        }
    },
    "garden": {
        "name": "Garden",
        "description": [
            "You are nearly blinded as you leave the courtyard for the nearby garden. It takes you a second to see the figure crouched ahead, petting his dog. You are startled by his voice.",
            "  *\"Oh! I'm glad you made it out! I was worried it was too tough. I hope you had a fun time in my mansion. I had a lot of fun making it. Please come back and visit some time again! Oh, and don't forget your prize.*",
            "You are delighted to have reached the end of the game, and look forward to a very Happy Halloween now that you are safely out of the mansion.",
            "Congratulations! You won!"
        ],
        "hint": ["No hint. This is the end! Thanks for playing :)"],
        "files": [
            {
                "name": "paper",
                "contents": [
                    "What? That's it! That's the game.",
                    "I already spent too many hours on this instead of actual work.",
                    "...",
                    "What, you want more?",
                    "Okay, one more secret!",
                    "Go back to the Foyer and then run the following command:",
                    "    cd crypt"
                ]
            }
        ],
        "links": ["courtyard"],
        "secretLinks": {}
    },
    "crypt": {
        "name": "Crypt",
        "description": [
            "You enter a foul, decrepit crypt.",
            "You can tell that something nefarious and evil lives here.",
            "The only item of interest, though, is a tomb on the other side of the room.",
            "Will you check the tomb?"
        ],
        "hint": ["Try checking the tomb with the less command."],
        "files": [
            {
                "name": "tomb",
                "contents": [
                    "SPOOKY SCARY SKELETONS WERE INSIDE!",
                    "BOO!",
                    "Okay, that was it. Thanks for playing!"
                ]
            }
        ],
        "links": ["foyer"],
        "secretLinks": {}
    }
}
